pwbf/RX64M_ETHERNET/r_t4_ftp_server_rx/src/r_ftp_server.c
/*******************************************************************************
* DISCLAIMER
* This software is supplied by Renesas Electronics Corporation and is only
* intended for use with Renesas products. No other uses are authorized. This
* software is owned by Renesas Electronics Corporation and is protected under
* all applicable laws, including copyright laws.
* THIS SOFTWARE IS PROVIDED "AS IS" AND RENESAS MAKES NO WARRANTIES REGARDING
* THIS SOFTWARE, WHETHER EXPRESS, IMPLIED OR STATUTORY, INCLUDING BUT NOT
* LIMITED TO WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE
* AND NON-INFRINGEMENT. ALL SUCH WARRANTIES ARE EXPRESSLY DISCLAIMED.
* TO THE MAXIMUM EXTENT PERMITTED NOT PROHIBITED BY LAW, NEITHER RENESAS
* ELECTRONICS CORPORATION NOR ANY OF ITS AFFILIATED COMPANIES SHALL BE LIABLE
* FOR ANY DIRECT, INDIRECT, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES FOR
* ANY REASON RELATED TO THIS SOFTWARE, EVEN IF RENESAS OR ITS AFFILIATES HAVE
* BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
* Renesas reserves the right, without notice, to make changes to this software
* and to discontinue the availability of this software. By using this software,
* you agree to the additional terms and conditions found by accessing the
* following link:
* http://www.renesas.com/disclaimer
*
* Copyright (C) 2011 Renesas Electronics Corporation. All rights reserved.
*******************************************************************************/
/*******************************************************************************
* File Name    : r_ftp_server.c
* Version      : 1.02
* Device(s)    :
* Tool-Chain   :
* OS           : none
* H/W Platform :
* Description  : FTP server code.
******************************************************************************/
/******************************************************************************
* History : DD.MM.YYYY Version Description
*         : 31.03.2011 1.00    First Release
*         : 16.04.2013 1.01    Changed sys_time to none static variable.
*         : 09.05.2014 1.02    Corresponded to FIT Modules
******************************************************************************/

/******************************************************************************
Includes <System Includes> , "Project Includes"
******************************************************************************/
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <ctype.h>
#include "r_t4_itcpip.h"
#include "r_t4_file_driver_rx_if.h"
#include "r_t4_ftp_server_rx_config.h"
#include "r_t4_ftp_server_rx_if.h"

/******************************************************************************
Macro definitions
******************************************************************************/
#define CONST const

/* status */
#define FTP_CLOSED         0
#define FTP_CLOSING        1
#define FTP_ACCEPT         2
#define FTP_CONNECTION     3
#define FTP_PASS_WORD      4
#define FTP_LOGIN          5

/* exec_command */
#define FTP_DATA_NONE     0
#define FTP_DATA_LIST     1
#define FTP_DATA_STOR     2
#define FTP_DATA_RETR     3
#define FTP_DATA_ABOR     4
#define FTP_DATA_PORT     6

/* exec_command_subseq */
#define FTP_DATA_LIST_SUBSEQ04   4
#define FTP_DATA_LIST_SUBSEQ08   8
#define FTP_DATA_LIST_SUBSEQ12   12
#define FTP_DATA_LIST_SUBSEQ16   16

#define FTP_DATA_STOR_SUBSEQ04   4

#define FTP_DATA_RETR_SUBSEQ04   4
#define FTP_DATA_RETR_SUBSEQ08   8
#define FTP_DATA_RETR_SUBSEQ12   12
#define FTP_DATA_RETR_SUBSEQ16   16

#define FTP_DATA_ABOR_SUBSEQ04   4
#define FTP_DATA_ABOR_SUBSEQ08   8


#define FTP_DATA_SUBSEQ_ERR  (-1)


/******************************************************************************
Typedef definitions
******************************************************************************/
typedef struct cep_
{
    uint8_t  status;        /* Connection state of the endpoint         */
    uint8_t  *buff_ptr;     /* Top address of the transmission and reception buffer    */
    int32_t  remain_data;   /* remainder transmission and reception number of bytes    */
    int32_t  now_data;      /* The number of bytes finished with transmission and reception  */
    T_IPV4EP dstaddr;       /* Client IP address            */
    T_IPV4EP myaddr;        /* Server IP address            */
    uint8_t  api_cancel;    /* API cancel request flag            */
} FTP_CEP;


typedef struct
{
    uint8_t   cmd_buff[CMD_BUF_SIZE];         /* transmission and reception buffer of the command endpoint    */
    uint8_t   data_buff[DATA_BUF_SIZE];       /* transmission and reception buffer of the data endpoint      */
    int8_t    current_path[PATH_NAME_SIZE];   /* Directory management              */
    int16_t   valid_dstaddr;                  /* PORT command receptionist            */
    uint8_t   trans_mode;                     /* ASCII or BINARY               */
    uint8_t   rnfr;                           /* RNFR command receptionist            */
    int8_t    fname[PATH_NAME_SIZE];          /* File name                */
    int32_t   file_index;                     /* A file maintenance structure body index number       */
    int16_t   exec_command;                   /* The data transmission classification that executing      */
    int16_t   exec_command_subseq;            /* A subsequence of data transmission          */
    int16_t   user_id;                        /* The number of the USER ID management table        */
    uint8_t   read_crlf_check;                /* character on the way at the time of the file reading with ASCII mode  */
    uint8_t   cep_reset_req;                  /* ftp_cep reset flag               */
    int32_t   dir_read_index;                 /* The reading position of the directory          */
    FILE_LIST file_list[FTP_MAX_FILE_LIST];   /* A list of files to generate in NLST,LIST command       */
} _FTP_STAT;

/******************************************************************************
Private global variables and functions
******************************************************************************/
static const uint8_t user_data[MAX_USER][16] = {USER_LIST};
static const uint8_t pass_data[MAX_USER][16] = {PASS_LIST};
static const uint8_t root_dir[MAX_USER][16]  = {ROOT_DIR_LIST};

static ER ftp_rcv_request(ID cepid, uint8_t *buf, int16_t buf_len, ER rcv_dat_size);
static ER strcat_with_check_len(uint8_t *src, uint8_t *concat, int32_t size);

static int16_t cmdline(int8_t *buf, int16_t *argc, int8_t **argv);

static int16_t ftps_retr(int16_t argc, int8_t **argv, ID cepid);
static int16_t ftps_port(int16_t argc, int8_t **argv, ID cepid);
static int16_t ftps_pasv(int16_t argc, int8_t **argv, ID cepid);
static int16_t ftps_user(int16_t argc, int8_t **argv, ID cepid);
static int16_t ftps_pass(int16_t argc, int8_t **argv, ID cepid);
static int16_t ftps_type(int16_t argc, int8_t **argv, ID cepid);
static int16_t ftps_quit(int16_t argc, int8_t **argv, ID cepid);
static int16_t ftps_noop(int16_t argc, int8_t **argv, ID cepid);
static int16_t ftps_stor(int16_t argc, int8_t **argv, ID cepid);
static int16_t ftps_list_nlst(int16_t argc, int8_t **argv, ID cepid);
static int16_t ftps_rnto(int16_t argc, int8_t **argv, ID cepid);
static int16_t ftps_rnfr(int16_t argc, int8_t **argv, ID cepid);
static int16_t ftps_dele(int16_t argc, int8_t **argv, ID cepid);
static int16_t ftps_cwd(int16_t argc, int8_t **argv, ID cepid);
static int16_t ftps_pwd(int16_t argc, int8_t **argv, ID cepid);
static int16_t ftps_mkd(int16_t argc, int8_t **argv, ID cepid);
static int16_t ftps_rmd(int16_t argc, int8_t **argv, ID cepid);
static int16_t ftps_cdup(int16_t argc, int8_t **argv, ID cepid);
static int16_t ftps_abor(int16_t argc, int8_t **argv, ID cepid);
static int16_t non_support_cmd(ID cepid, int8_t *argv);
static int16_t ftps_list_nlst_dataport(ID cepid);
static int16_t ftps_list_nlst_finish(ID cepid);
static int16_t ftps_stor_dataport(ID cepid, int32_t rcv_len);
static int16_t ftps_stor_finish(ID cepid);
static int16_t ftps_retr_dataport(ID cepid);
static int16_t ftps_retr_finish(ID cepid);
static void ftps_abor_finish(ID cepid);
static int32_t stricmp_rx(const uint8_t *s1, const uint8_t *s2, int32_t count);
static int32_t path_concatenate(ID cepid , uint8_t *buf, uint32_t buf_len, uint8_t *path);

