pwbf/RX64M_ETHERNET/r_t4_ftp_server_rx/src/r_ftp_server.c
ER ftp_callback(ID cepid, FN fncd , VP p_parblk);
ER ftp_data_callback(ID cepid, FN fncd , VP p_parblk);

//SYS_TIME sys_time;

/*------------ GLOBAL -----------*/

/******************************************************************************
Exported global variables and functions (to be accessed by other files)
******************************************************************************/
FTP_CEP  ftp_cep[FTP_TCP_CEP_NUM];
_FTP_STAT ftp_stat[FTP_TCP_CEP_NUM/2];

/******************************************************************************
Imported global variables and functions (from other files)
******************************************************************************/
extern char _T4_Version[];
//extern const H __tcpcepn;
//extern T_TCP_CCEP tcp_ccep[];
extern T_TCP_CREP tcp_crep[];
//extern const H __tcprepn;
extern TCPUDP_ENV tcpudp_env;

uint8_t far *ftps_cmd_tbl[]
= { "STOR", "RETR", "PASV", "ABOR",
    "USER", "PASS", "TYPE", "PWD", "XPWD", "CWD", "CDUP", "QUIT", "DELE",
    "PORT", "LIST", "NLST", "MKD", "XMKD",
    "RMD", "XRMD",  "RNFR", "RNTO", "NOOP",
    NULL
  };
int16_t (*ftps_cmd_exe[])(int16_t, int8_t **, ID cepid)
= { ftps_stor, ftps_retr, ftps_pasv, ftps_abor,
    ftps_user, ftps_pass, ftps_type, ftps_pwd, ftps_pwd, ftps_cwd, ftps_cdup, ftps_quit, ftps_dele,
    ftps_port, ftps_list_nlst, ftps_list_nlst, ftps_mkd, ftps_mkd,
    ftps_rmd, ftps_rmd, ftps_rnfr, ftps_rnto, ftps_noop,
  };

/*------------ PROCESS -----------*/

/******************************************************************************
* Function Name : R_ftp_srv_open
* Description   : Start the FTP server.
* Argument      : none
* Return Value  : none
******************************************************************************/
void R_ftp_srv_open(void)
{
    int16_t loop;
    int32_t ip_work;

    memset(ftp_cep, 0, sizeof(ftp_cep));
    memset(ftp_stat, 0, sizeof(ftp_stat));

    ip_work = ((uint32_t)tcpudp_env.ipaddr[0] << 24) + ((uint32_t)tcpudp_env.ipaddr[1] << 16) + ((uint32_t)tcpudp_env.ipaddr[2] << 8) + (uint32_t)tcpudp_env.ipaddr[3];

    for (loop = 0; loop < FTP_TCP_CEP_NUM; loop++)
    {
        ftp_cep[loop].myaddr.ipaddr = ip_work;
        if ((loop % 2) == 1)
        {
            ftp_cep[loop].buff_ptr = ftp_stat[loop/2].data_buff;
            ftp_cep[loop].myaddr.portno = 20;  /* Port number */
        }
        else
        {
            ftp_cep[loop].buff_ptr = ftp_stat[loop/2].cmd_buff;
            ftp_cep[loop].myaddr.portno = 21;  /* Port number */
        }
    }
    return;
}


/******************************************************************************
* Function Name : R_ftpd
* Description   : Check the FTP server status.
* Argument      : none
* Return Value  : none
******************************************************************************/
void R_ftpd(void)
{
    ER   ercd;
    int32_t i;
    int32_t ip_work;

    if (0 != (FTP_START_TCP_CEP % 2))
    {
        while (1); /* System Error!! */
    }

    /* checks the state of all communication endpoints */
    for (i = 0; i < FTP_TCP_CEP_NUM; i += 2)
    {
        switch (ftp_cep[i].status)
        {
            case FTP_CLOSED:
                /* accept */
                ercd = tcp_acp_cep(i + FTP_START_TCP_CEP + 1, i + FTP_START_TCP_CEP + 1, &(ftp_cep[i].dstaddr), TMO_NBLK);
                if (ercd != E_WBLK)
                {
                    while (1);
                }
                ftp_cep[i].status = FTP_ACCEPT;
                break;
            default:
                break;
        }
    }

    for (i = 0;i < FTP_TCP_CEP_NUM / 2;i++)
    {
        if (ftp_stat[i].cep_reset_req > 0)
        {
            ftp_cep[i*2].api_cancel = 0;
            ftp_cep[i*2+1].api_cancel = 0;
            switch (ftp_stat[i].cep_reset_req & 0xf0)
            {
                case 0x10:
                    ftp_stat[i].cep_reset_req = 0x20;
                    ercd = tcp_can_cep(i * 2 + FTP_START_TCP_CEP + 2, TFN_TCP_ALL);
                    if (ercd == E_OK)
                    {
                    }
                    else
                    {
                        tcp_cls_cep(i*2 + FTP_START_TCP_CEP + 2, 1);
                        ftp_stat[i].cep_reset_req |= 0x03;
                    }
                    ercd = tcp_can_cep(i * 2 + FTP_START_TCP_CEP + 1, TFN_TCP_ALL);
                    if (ercd == E_OK)
                    {
                    }
                    else
                    {
                        tcp_cls_cep(i*2 + FTP_START_TCP_CEP + 1, 1);
                        ftp_stat[i].cep_reset_req |= 0x0c;
                    }
                    /* not break */
                case 0x20:
                    if ((ftp_stat[i].cep_reset_req & 0x01) == 0x01)
                    {
                        if ((ftp_stat[i].cep_reset_req & 0x02) != 0x02)
                        {
                            tcp_cls_cep(i*2 + FTP_START_TCP_CEP + 2, 1);
                            ftp_stat[i].cep_reset_req |= 0x02;
                        }
                    }
                    if ((ftp_stat[i].cep_reset_req & 0x04) == 0x04)
                    {
                        if ((ftp_stat[i].cep_reset_req & 0x08) != 0x08)
                        {
                            tcp_cls_cep(i*2 + FTP_START_TCP_CEP + 1, 1);
                            ftp_stat[i].cep_reset_req |= 0x08;
                        }
                    }
                    if ((ftp_stat[i].cep_reset_req & 0x0f) == 0x0f)
                    {
                        file_close(ftp_stat[i].file_index);
                        memset(&ftp_cep[i*2] , 0 , sizeof(FTP_CEP));
                        memset(&ftp_cep[i*2+1] , 0 , sizeof(FTP_CEP));
                        memset(&ftp_stat[i], 0 , sizeof(_FTP_STAT));
                        ip_work = ((uint32_t)tcpudp_env.ipaddr[0] << 24) + ((uint32_t)tcpudp_env.ipaddr[1] << 16) + ((uint32_t)tcpudp_env.ipaddr[2] << 8) + (uint32_t)tcpudp_env.ipaddr[3];
                        ftp_cep[i*2].myaddr.ipaddr = ip_work;
                        ftp_cep[i*2].buff_ptr = ftp_stat[i].cmd_buff;
                        ftp_cep[i*2].myaddr.portno = 21;  /* Port number */
                        ftp_cep[i*2+1].myaddr.ipaddr = ip_work;
                        ftp_cep[i*2+1].buff_ptr = ftp_stat[i].data_buff;
                        ftp_cep[i*2+1].myaddr.portno = 20;  /* Port number */
                        ftp_stat[i].cep_reset_req = 0;
                    }
                    break;
            }

