pwbf/RX64M_ETHERNET/r_t4_ftp_server_rx/src/r_ftp_server.c
        }
    }
    for (i = 0; i < FTP_TCP_CEP_NUM; i++)
    {
        if (ftp_cep[i].api_cancel == 1)
        {
            ercd = tcp_can_cep(i + FTP_START_TCP_CEP + 1, TFN_TCP_ALL);
            ftp_cep[i].api_cancel = 2;
        }
    }
}

/******************************************************************************
* Function Name : R_ftp_srv_close
* Description   : Close the FTP server.
* Argument      : none
* Return Value  : none
******************************************************************************/
void R_ftp_srv_close(void)
{
    return;
}



static ER ftp_rcv_request(ID cepid, uint8_t *buf, int16_t buf_len, ER rcv_dat_size)
{

    uint8_t *ptr;

    if (rcv_dat_size <= 0)
    {
        ftp_cep[cepid-1].remain_data = 0;
        return -1;
    }

    ftp_cep[cepid-1].remain_data += rcv_dat_size;

    if (ftp_cep[cepid-1].remain_data > (buf_len - 1))
    {
        /* full of buffer */
        ftp_cep[cepid-1].remain_data = 0;
        return -1;
    }
    buf[ftp_cep[cepid-1].remain_data] = '\0';

    ptr = (uint8_t *)strstr((char*)buf, "\r\n");
    if (ptr != 0)
    {
        *(ptr + 2) = '\0';
        ftp_cep[cepid-1].remain_data = 0;
        return 0;
    }

    /* continue receiving */
    return 1;
}



static ER strcat_with_check_len(uint8_t *src, uint8_t *concat, int32_t size)
{
    if (strlen((const char *)src) + strlen((const char *)concat) >= size)
    {
        return -1;
    }
    strcat((char *)src, (const char *)concat);
    return 0;
}



static int16_t cmdline(int8_t *buf, int16_t *argc, int8_t **argv)
{
    uint8_t *p;
    int16_t  cnt = 0;

    p = (uint8_t *)buf;

    while (1)
    {
        if (cnt == 0)
        {
            /*  find command head : skip space(0x20) and skip excluding ascii code (ex. abort sequence) until finding command head */
            while (*p >= 0x80 || (isspace(*p) != 0))
            {
                p++;
            }
        }
        else
        {
            /* find parameter head : skip space(0x20) */
            while (isspace(*p) != 0)
            {
                p++;
            }
        }

        if (*p == '\0')
        {
            /* command fixes (ex : [command],[sp],[null]) */
            break;
        }
        argv[cnt++] = (int8_t *)p;

        while ((isspace(*p) == 0) && (*p != '\0'))
        {
            /* find command or parameter end */
            p++;
        }

        if (*p == '\0')
        {
            /* command fixes (ex : [command],[sp],[parameter],[null]) */
            break;
        }
        else
        {
            /* contine searching */
            *p++ = '\0';
        }

        if (cnt >= MAX_ARGC)
        {
            /* check parameter number limitation */
            break;
        }
    }

    *argc = cnt;
    return (cnt);
}


static int16_t ftps_user(int16_t argc, int8_t **argv, ID cepid)
{
    uint8_t username[USER_NAME_SIZE+1];
    int8_t loop;

    ftp_stat[(cepid-1)/2].rnfr = 0;
    if (argc != 2)
    {
        ftp_cep[cepid-1].remain_data = sizeof(MSG_PARAM_ERROR) - 1;
        strcpy((char *)(ftp_cep[cepid-1].buff_ptr), MSG_PARAM_ERROR);
        ftp_cep[cepid-1].status = FTP_CLOSING;
        return (-1);
    }

    strcpy((char *)username, (const char *)argv[1]);

    for (loop = 0; loop < MAX_USER; loop++)
    {
        if (strcmp((char*)user_data[loop], (char*)(argv[1])) == 0)
        {
            ftp_cep[cepid-1].remain_data = sprintf((char *)(ftp_cep[cepid-1].buff_ptr), MSG_PASSWD_REQ, (char*)(username));
            ftp_stat[(cepid-1)/2].user_id = loop;
            ftp_cep[cepid-1].status = FTP_PASS_WORD;
            break;
        }
    }
    if (loop >= MAX_USER)
    {
        ftp_cep[cepid-1].remain_data = sizeof(MSG_PARAM_ERROR) - 1;
        strcpy((char *)(ftp_cep[cepid-1].buff_ptr), MSG_PARAM_ERROR);
        ftp_cep[cepid-1].status = FTP_CLOSING;
        return (-1);
    }
    return (0);
}



static int16_t ftps_pass(int16_t argc, int8_t **argv, ID cepid)
{
    int16_t ret = -1;

    ftp_stat[(cepid-1)/2].rnfr = 0;
    if (ftp_cep[cepid-1].status != FTP_PASS_WORD)
    {
        ftp_cep[cepid-1].remain_data = sizeof(MSG_CMD_BAD_SEQ) - 1;
        strcpy((char *)(ftp_cep[cepid-1].buff_ptr), MSG_CMD_BAD_SEQ);
        ftp_cep[cepid-1].status = FTP_CONNECTION;
    }
    else if (argc != 2)
    {
        ftp_cep[cepid-1].remain_data = sizeof(MSG_PARAM_ERROR) - 1;
        strcpy((char *)(ftp_cep[cepid-1].buff_ptr), MSG_PARAM_ERROR);
    }
    else
    {
        if (strcmp((char*)pass_data[ftp_stat[(cepid-1)/2].user_id], (char*)(argv[1])) == 0)
        {
            ftp_cep[cepid-1].remain_data = sprintf((char *)(ftp_cep[cepid-1].buff_ptr), MSG_AUTHENTICATION_OK, ((char*)user_data[ftp_stat[(cepid-1)/2].user_id]));
            strcpy((char *)(ftp_stat[(cepid-1)/2].current_path), (const char *)root_dir[ftp_stat[(cepid-1)/2].user_id]);
            ftp_cep[cepid-1].status = FTP_LOGIN;
            ftp_stat[(cepid-1)/2].trans_mode = 'A';
            ret = 0;
        }
        else
        {
            ftp_cep[cepid-1].remain_data = sizeof(MSG_AUTHENTICATION_NG) - 1;
            strcpy((char *)(ftp_cep[cepid-1].buff_ptr), MSG_AUTHENTICATION_NG);
            ftp_cep[cepid-1].status = FTP_CONNECTION;
        }
    }
    return (ret);
}


static int16_t ftps_pwd(int16_t argc, int8_t **argv, ID cepid)
{
    ftp_stat[(cepid-1)/2].rnfr = 0;
    if (ftp_cep[cepid-1].status < FTP_LOGIN)
    {
        ftp_cep[cepid-1].remain_data = sprintf((char *)(ftp_cep[cepid-1].buff_ptr), MSG_NOT_AVAILABLE);
        ftp_cep[cepid-1].status = FTP_CLOSING;
        return (-1);
    }
    ftp_cep[cepid-1].remain_data = sprintf((char *)(ftp_cep[cepid-1].buff_ptr), MSG_PWD_RESPONSE, ftp_stat[(cepid-1)/2].current_path);
    return (0);
}



static int16_t ftps_type(int16_t argc, int8_t **argv, ID cepid)
{

    ftp_stat[(cepid-1)/2].rnfr = 0;
    if (ftp_cep[cepid-1].status < FTP_LOGIN)
    {
        ftp_cep[cepid-1].remain_data = sprintf((char *)(ftp_cep[cepid-1].buff_ptr), MSG_NOT_AVAILABLE);
        ftp_cep[cepid-1].status = FTP_CLOSING;
        return (-1);
    }

