pwbf/RX64M_ETHERNET/r_t4_ftp_server_rx/src/r_ftp_server.c
    if (argc == 2)
    {
        if (strcmp((char *)argv[1], "A") == 0 || strcmp((char *)argv[1], "I") == 0)
        {
            ftp_stat[(cepid-1)/2].trans_mode = argv[1][0];
            ftp_cep[cepid-1].remain_data = sprintf((char *)(ftp_cep[cepid-1].buff_ptr), MSG_TYPE_SET, ftp_stat[(cepid-1)/2].trans_mode);
            return (0);
        }
    }

    ftp_cep[cepid-1].remain_data = sizeof(MSG_PARAM_ERROR) - 1;
    strcpy((char *)(ftp_cep[cepid-1].buff_ptr), MSG_PARAM_ERROR);
    return (-1);

}


static int16_t ftps_list_nlst(int16_t argc, int8_t **argv, ID cepid)
{
    int16_t ret;
    _FTP_STAT *pftpstat;
    FTP_CEP   *pcep;

    pftpstat =  &ftp_stat[(cepid-1)/2];
    pcep  =  &ftp_cep[cepid-1];

    pftpstat->rnfr = 0;
    if (pcep->status < FTP_LOGIN)
    {
        pcep->remain_data = sprintf((char *)(pcep->buff_ptr), MSG_NOT_AVAILABLE);
        pcep->status = FTP_CLOSING;
        return (-1);
    }

    pftpstat->exec_command = FTP_DATA_LIST;
    pftpstat->exec_command_subseq = FTP_DATA_LIST_SUBSEQ04;

    if (pftpstat->trans_mode == 'A')
    {
        pftpstat->dir_read_index = 0;
        pcep->remain_data = sprintf((char *)(pcep->buff_ptr), MSG_OPEN_DATA_CON, "ASCII");
        ret = 0;
    }
    else
    {
        pcep->remain_data = sprintf((char *)(pcep->buff_ptr), MSG_INVALID_PATH);
        pftpstat->exec_command_subseq = FTP_DATA_SUBSEQ_ERR;
        ret = -1;
    }
    pcep->remain_data = strlen((const char *)pcep->buff_ptr);

    return (ret);
}


static int16_t ftps_list_nlst_dataport(ID cepid)
{
    uint8_t *p;
    int32_t ret;
    int32_t count;
    int32_t total_count;
    _FTP_STAT *pftpstat;
    FTP_CEP   *pcep;
    uint8_t tmp_buf[512];
    uint8_t tmp_buf2[12];
    ER ercd = 0;

    pftpstat =  &ftp_stat[(cepid-1)/2];
    pcep  =  &ftp_cep[cepid-1];

    tmp_buf[0] = 0;

    pftpstat->exec_command_subseq = FTP_DATA_LIST_SUBSEQ08;

    p = pcep->buff_ptr;

    pcep->buff_ptr[0] = 0;

    total_count = 0;
    while (ercd == 0)
    {
        /* It retrieves file information for the number of FTP_MAX_FILE_LIST */
        ret = get_file_list_info((uint8_t *)pftpstat->current_path, pftpstat->file_list, FTP_MAX_FILE_LIST, pftpstat->dir_read_index);

        if (ret < 0)
        {
            pftpstat->exec_command_subseq = FTP_DATA_SUBSEQ_ERR;
            return -1;
        }

        for (count = 0; count < ret; count++, total_count++)
        {
            if ((pftpstat->file_list[count].file_attr & FILE_ATTR_DIR) == FILE_ATTR_DIR)
            {
                strcpy((char *)tmp_buf, "drwxrwxrwx 1 root default          0 ");
            }
            else
            {
                strcpy((char *)tmp_buf, "-rwxrwxrwx 1 root default ");
                sprintf((char *)tmp_buf2, "%10ld ", pftpstat->file_list[count].file_size);
                strcat((char *)tmp_buf, (const char *)tmp_buf2);
            }
            ercd += strcat_with_check_len(pcep->buff_ptr, tmp_buf, DATA_BUF_SIZE);

            /* Last modified */
            sprintf((char *)tmp_buf, "%s %02d %02d:%02d: ",
                    pftpstat->file_list[count].date_info.month,
                    pftpstat->file_list[count].date_info.day,
                    pftpstat->file_list[count].date_info.hour,
                    pftpstat->file_list[count].date_info.min
                   );
            ercd += strcat_with_check_len(pcep->buff_ptr, tmp_buf, DATA_BUF_SIZE);

            strcpy((char *)tmp_buf, (char *)pftpstat->file_list[count].file_name);
            strcat((char *)tmp_buf, "\r\n");

            ercd += strcat_with_check_len(pcep->buff_ptr, tmp_buf, DATA_BUF_SIZE);
            if (ercd == 0)
            {
                /* There is a space in the transmission of a message buffer. NULL insertion point update */
                p = &pcep->buff_ptr[strlen((char*)pcep->buff_ptr)];
            }
            else
            {
                /* There is no a space in the transmission of a message buffer. NULL insert */
                *p = '\0';
                break;
            }
        }
        pftpstat->dir_read_index += count;
        if (ret < FTP_MAX_FILE_LIST)
        {
            /* Finish reading file information */
            break;
        }
    }
    if (count >= ret)
    {
        if (ret < FTP_MAX_FILE_LIST)
        {
            /* Finish reading file information */
            pftpstat->exec_command_subseq = FTP_DATA_LIST_SUBSEQ12;
        }
        else
        {
            /* continue reading */
            *p = '\0';
        }
    }
    else
    {
        /* continue reading */
        *p = '\0';
    }
    pcep->remain_data = strlen((const char *)pcep->buff_ptr);

    return total_count;
}


static int16_t ftps_list_nlst_finish(ID cepid)
{
    _FTP_STAT *pftpstat;
    FTP_CEP   *pcep;

    pftpstat =  &ftp_stat[(cepid-1)/2];
    pcep  =  &ftp_cep[cepid-1];

    if (pftpstat->exec_command_subseq != FTP_DATA_LIST_SUBSEQ16)
    {
        pcep->remain_data = sprintf((char *)(ftp_cep[cepid-1].buff_ptr), MSG_EXEC_ERROR);
    }
    else
    {
        pcep->remain_data = sprintf((char *)(ftp_cep[cepid-1].buff_ptr), MSG_TRNS_CMPLT);
    }

    pftpstat->exec_command = FTP_DATA_NONE;
    pftpstat->exec_command_subseq = 0;

    pcep->remain_data = strlen((const char *)pcep->buff_ptr);

    return (0);
}


static int16_t ftps_port(int16_t argc, int8_t **argv, ID cepid)
{
    int16_t   ip0, ip1, ip2, ip3, port0, port1;
    FTP_CEP   *cmd_pcep;
    FTP_CEP   *data_pcep;
    _FTP_STAT *pftpstat;

    cmd_pcep = (&ftp_cep[cepid-1]);
    data_pcep = (&ftp_cep[cepid]);
    pftpstat = (&ftp_stat[(cepid-1)/2]);

    pftpstat->rnfr = 0;
    if (cmd_pcep->status < FTP_LOGIN)
    {
        cmd_pcep->remain_data = sprintf((char *)(cmd_pcep->buff_ptr), MSG_NOT_AVAILABLE);
        cmd_pcep->status = FTP_CLOSING;
        return (-1);
    }

    if (argc != 2)
    {
        cmd_pcep->remain_data = sizeof(MSG_PARAM_ERROR) - 1;
        strcpy((char *)(cmd_pcep->buff_ptr), MSG_PARAM_ERROR);
        return (-1);
    }

    sscanf((char*)argv[1], "%hd,%hd,%hd,%hd,%hd,%hd", &ip0, &ip1, &ip2, &ip3, &port0, &port1);
    data_pcep->dstaddr.ipaddr = ((uint32_t)ip0 << 24) + ((uint32_t)ip1 << 16)
                                + ((uint32_t)ip2 << 8) + (uint32_t)ip3;
    data_pcep->dstaddr.portno = port0 * 256 + port1;  /* Port number */

    data_pcep->myaddr.portno = 20;  /* Port number */

    pftpstat->valid_dstaddr = 1;

    /* The making of the command normal end message */
    cmd_pcep->remain_data = sprintf((char *)(cmd_pcep->buff_ptr), MSG_CMD_ACCEPTED, "PORT");
    pftpstat->exec_command = FTP_DATA_PORT;
    return (0);

