pwbf/RX64M_ETHERNET/r_t4_ftp_server_rx/src/r_ftp_server.c
    }
    else
    {
        /* BINARY mode */
        readsize = file_read(pftpstat->file_index, pcep->buff_ptr, DATA_BUF_SIZE);
        if (readsize < 0)
        {
            file_close(pftpstat->file_index);
            pftpstat->exec_command_subseq = FTP_DATA_SUBSEQ_ERR;
            return -1;
        }

        if (readsize == 0)
        {
            file_close(pftpstat->file_index);
            pftpstat->exec_command_subseq = FTP_DATA_RETR_SUBSEQ12;
        }

        pcep->remain_data = readsize;

    }


    return pcep->remain_data;
}


static int16_t ftps_retr_finish(ID cepid)
{
    _FTP_STAT *pftpstat;
    FTP_CEP   *pcep;

    pftpstat =  &ftp_stat[(cepid-1)/2];
    pcep  =  &ftp_cep[cepid-1];

    if (pftpstat->exec_command_subseq != FTP_DATA_RETR_SUBSEQ16)
    {
        pcep->remain_data = sprintf((char *)(pcep->buff_ptr), MSG_EXEC_ERROR);
    }
    else
    {
        pcep->remain_data = sprintf((char *)(pcep->buff_ptr), MSG_TRNS_CMPLT);
    }

    pftpstat->exec_command = FTP_DATA_NONE;
    pftpstat->exec_command_subseq = 0;

    pcep->remain_data = strlen((const char *)pcep->buff_ptr);

    return (0);
}


static int16_t ftps_stor(int16_t argc, int8_t **argv, ID cepid)
{
    int32_t file_index;
    _FTP_STAT *pftpstat;
    FTP_CEP   *pcep;
    uint8_t  tmp_buf[512];

    pftpstat =  &ftp_stat[(cepid-1)/2];
    pcep  =  &ftp_cep[cepid-1];

    pftpstat->rnfr = 0;
    if (pcep->status < FTP_LOGIN)
    {
        pcep->remain_data = sprintf((char *)(pcep->buff_ptr), MSG_NOT_AVAILABLE);
        pcep->status = FTP_CLOSING;
        return (-1);
    }

    pftpstat->exec_command = FTP_DATA_STOR;
    pftpstat->exec_command_subseq = FTP_DATA_STOR_SUBSEQ04;

    if (argc != 2)
    {
        pcep->remain_data = sizeof(MSG_PARAM_ERROR) - 1;
        strcpy((char *)(pcep->buff_ptr), MSG_PARAM_ERROR);
        pftpstat->exec_command_subseq = FTP_DATA_SUBSEQ_ERR;
        return -1;
    }

    strcpy((char *)(pftpstat->fname), (const char *)argv[1]);

    if (0 != path_concatenate(cepid , tmp_buf, sizeof(tmp_buf), (uint8_t *)argv[1]))
    {
        pcep->remain_data = sizeof(MSG_EXEC_ERROR) - 1;
        strcpy((char *)(pcep->buff_ptr), MSG_EXEC_ERROR);
        return -1;
    }

    file_index = file_open((uint8_t *)tmp_buf, FILE_WRITE);
    if (file_index < 0)
    {
        pcep->remain_data = sizeof(MSG_NO_SUCH_FILE) - 1;
        strcpy((char *)(pcep->buff_ptr), MSG_NO_SUCH_FILE);
        pftpstat->exec_command_subseq = FTP_DATA_SUBSEQ_ERR;
        return -1;
    }
    else
    {
        pftpstat->file_index = file_index;
        if (pftpstat->trans_mode == 'A')
        {
            pcep->remain_data = sprintf((char *)(pcep->buff_ptr), MSG_OPEN_DATA_CON, "ASCII");
        }
        else
        {
            pcep->remain_data = sprintf((char *)(pcep->buff_ptr), MSG_OPEN_DATA_CON, "IMAGE");
        }
    }

    return (0);
}


static int16_t ftps_stor_dataport(ID cepid, int32_t rcv_len)
{
    _FTP_STAT *pftpstat;
    FTP_CEP   *pcep;

    pftpstat =  &ftp_stat[(cepid-1)/2];
    pcep  =  &ftp_cep[cepid-1];

    if (file_write(pftpstat->file_index, pcep->buff_ptr, rcv_len) < 0)
    {
        file_close(pftpstat->file_index);
        pftpstat->exec_command_subseq = FTP_DATA_SUBSEQ_ERR;
        return -1;
    }
    return 0;
}


static int16_t ftps_stor_finish(ID cepid)
{
    _FTP_STAT *pftpstat;
    FTP_CEP   *pcep;

    pftpstat =  &ftp_stat[(cepid-1)/2];
    pcep  =  &ftp_cep[cepid-1];

    if (pftpstat->exec_command_subseq != FTP_DATA_STOR_SUBSEQ04)
    {
        pcep->remain_data = sprintf((char *)(pcep->buff_ptr), MSG_EXEC_ERROR);
    }
    else
    {
        pcep->remain_data = sprintf((char *)(pcep->buff_ptr), MSG_TRNS_CMPLT);
    }

    pftpstat->exec_command = FTP_DATA_NONE;
    pftpstat->exec_command_subseq = 0;

    pcep->remain_data = strlen((const char *)pcep->buff_ptr);

    return (0);
}


static int16_t ftps_mkd(int16_t argc, int8_t **argv, ID cepid)
{
    int32_t ret;
    uint8_t tmp_path[256];

    ftp_stat[(cepid-1)/2].rnfr = 0;
    if (ftp_cep[cepid-1].status < FTP_LOGIN)
    {
        ftp_cep[cepid-1].remain_data = sprintf((char *)(ftp_cep[cepid-1].buff_ptr), MSG_NOT_AVAILABLE);
        ftp_cep[cepid-1].status = FTP_CLOSING;
        return (-1);
    }
    if (argc != 2)
    {
        ftp_cep[cepid-1].remain_data = sizeof(MSG_PARAM_ERROR) - 1;
        strcpy((char *)(ftp_cep[cepid-1].buff_ptr), MSG_PARAM_ERROR);
        return -1;
    }

    if (0 != path_concatenate(cepid , tmp_path, sizeof(tmp_path), (uint8_t *)argv[1]))
    {
        ftp_cep[cepid-1].remain_data = sizeof(MSG_EXEC_ERROR) - 1;
        strcpy((char *)(ftp_cep[cepid-1].buff_ptr), MSG_EXEC_ERROR);
        return -1;
    }

    ret = make_dir((uint8_t*)tmp_path);
    switch (ret)
    {
        case -1:
            ftp_cep[cepid-1].remain_data = sizeof(MSG_INVALID_PATH) - 1;
            strcpy((char *)(ftp_cep[cepid-1].buff_ptr), MSG_INVALID_PATH);
            break;
        default:
            ftp_cep[cepid-1].remain_data = sizeof(MSG_MKD_RESPONSE) - 1;
            strcpy((char *)(ftp_cep[cepid-1].buff_ptr), MSG_MKD_RESPONSE);
            break;
    }
    return (0);
}


static int16_t ftps_cwd(int16_t argc, int8_t **argv, ID cepid)
{
    int32_t ret;
    uint8_t tmp_path[256];
    uint8_t cmdname[5];
    int32_t len;

    ftp_stat[(cepid-1)/2].rnfr = 0;
    if (ftp_cep[cepid-1].status < FTP_LOGIN)
    {
        ftp_cep[cepid-1].remain_data = sprintf((char *)(ftp_cep[cepid-1].buff_ptr), MSG_NOT_AVAILABLE);
        ftp_cep[cepid-1].status = FTP_CLOSING;
        return (-1);
    }
    if (argc != 2)
    {
        ftp_cep[cepid-1].remain_data = sizeof(MSG_PARAM_ERROR) - 1;
        strcpy((char *)(ftp_cep[cepid-1].buff_ptr), MSG_PARAM_ERROR);
        return -1;
    }

    strcpy((char *)cmdname, (const char *)argv[0]);

    if (0 != path_concatenate(cepid , tmp_path, sizeof(tmp_path), (uint8_t *)argv[1]))
    {
        ftp_cep[cepid-1].remain_data = sizeof(MSG_EXEC_ERROR) - 1;
        strcpy((char *)(ftp_cep[cepid-1].buff_ptr), MSG_EXEC_ERROR);
        return -1;
    }

    len = strlen((char *)tmp_path);
    if (len > 1 && tmp_path[len-1] == '/')
    {
        tmp_path[len-1] = '\0';
    }

    ret = change_dir(tmp_path);
    if (ret == 0)
    {
        ftp_cep[cepid-1].remain_data = sprintf((char *)(ftp_cep[cepid-1].buff_ptr), MSG_CMD_SUCCESS, cmdname);
        strcpy((char *)(ftp_stat[(cepid-1)/2].current_path), (const char *)tmp_path);

