pwbf/RX64M_ETHERNET/r_t4_ftp_server_rx/src/r_ftp_server.c
    }
    else
    {
        ftp_cep[cepid-1].remain_data = sizeof(MSG_INVALID_PATH) - 1;
        strcpy((char *)(ftp_cep[cepid-1].buff_ptr), MSG_INVALID_PATH);
    }


    return ret;
}


static int16_t ftps_cdup(int16_t argc, int8_t **argv, ID cepid)
{
    uint8_t tmp_path[256];
    uint8_t cmdname[5];
    uint16_t len, loop;

    ftp_stat[(cepid-1)/2].rnfr = 0;
    if (ftp_cep[cepid-1].status < FTP_LOGIN)
    {
        ftp_cep[cepid-1].remain_data = sprintf((char *)(ftp_cep[cepid-1].buff_ptr), MSG_NOT_AVAILABLE);
        ftp_cep[cepid-1].status = FTP_CLOSING;
        return (-1);
    }

    strcpy((char *)cmdname, (const char *)argv[0]);

    strcpy((char *)tmp_path, (char *)(ftp_stat[(cepid-1)/2].current_path));
    if (strlen((char *)(ftp_stat[(cepid-1)/2].current_path)) == 1)
    {
        ftp_cep[cepid-1].remain_data = sizeof(MSG_INVALID_PATH) - 1;
        strcpy((char *)(ftp_cep[cepid-1].buff_ptr), MSG_INVALID_PATH);
    }
    else
    {
        len = strlen((char*)tmp_path);
        for (loop = len;loop > 0; loop--)
        {
            if (tmp_path[loop] == '/')
            {
                tmp_path[loop] = 0;
                break;
            }
            else
            {
                tmp_path[loop] = 0;
            }
        }
        ftp_cep[cepid-1].remain_data = sprintf((char *)(ftp_cep[cepid-1].buff_ptr), MSG_CMD_SUCCESS, cmdname);
        strcpy((char *)(ftp_stat[(cepid-1)/2].current_path), (const char *)tmp_path);
    }

    return (0);
}


static int16_t ftps_dele(int16_t argc, int8_t **argv, ID cepid)
{
    uint8_t tmp_path[256];
    uint8_t cmdname[5];

    ftp_stat[(cepid-1)/2].rnfr = 0;
    if (ftp_cep[cepid-1].status < FTP_LOGIN)
    {
        ftp_cep[cepid-1].remain_data = sprintf((char *)(ftp_cep[cepid-1].buff_ptr), MSG_NOT_AVAILABLE);
        ftp_cep[cepid-1].status = FTP_CLOSING;
        return (-1);
    }
    if (argc != 2)
    {
        ftp_cep[cepid-1].remain_data = sizeof(MSG_PARAM_ERROR) - 1;
        strcpy((char *)(ftp_cep[cepid-1].buff_ptr), MSG_PARAM_ERROR);
        return -1;
    }

    strcpy((char *)cmdname, (const char *)argv[0]);

    if (0 != path_concatenate(cepid , tmp_path, sizeof(tmp_path), (uint8_t *)argv[1]))
    {
        ftp_cep[cepid-1].remain_data = sizeof(MSG_EXEC_ERROR) - 1;
        strcpy((char *)(ftp_cep[cepid-1].buff_ptr), MSG_EXEC_ERROR);
        return -1;
    }


    if (file_delete((uint8_t *)tmp_path) == 0)
    {
        ftp_cep[cepid-1].remain_data = sprintf((char *)(ftp_cep[cepid-1].buff_ptr), MSG_CMD_SUCCESS, cmdname);
        return (0);
    }
    else
    {
        ftp_cep[cepid-1].remain_data = sizeof(MSG_INVALID_PATH) - 1;
        strcpy((char *)(ftp_cep[cepid-1].buff_ptr), MSG_INVALID_PATH);
        return (-1);
    }
}


static int16_t ftps_rmd(int16_t argc, int8_t **argv, ID cepid)
{
    int32_t ret;

    uint8_t tmp_path[256];

    ftp_stat[(cepid-1)/2].rnfr = 0;
    if (ftp_cep[cepid-1].status < FTP_LOGIN)
    {
        ftp_cep[cepid-1].remain_data = sprintf((char *)(ftp_cep[cepid-1].buff_ptr), MSG_NOT_AVAILABLE);
        ftp_cep[cepid-1].status = FTP_CLOSING;
        return (-1);
    }
    if (argc != 2)
    {
        ftp_cep[cepid-1].remain_data = sizeof(MSG_PARAM_ERROR) - 1;
        strcpy((char *)(ftp_cep[cepid-1].buff_ptr), MSG_PARAM_ERROR);
        return -1;
    }

    if (0 != path_concatenate(cepid , tmp_path, sizeof(tmp_path), (uint8_t *)argv[1]))
    {
        ftp_cep[cepid-1].remain_data = sizeof(MSG_EXEC_ERROR) - 1;
        strcpy((char *)(ftp_cep[cepid-1].buff_ptr), MSG_EXEC_ERROR);
        return -1;
    }

    ret = remove_dir((uint8_t *)tmp_path);
    switch (ret)
    {
        case -1:
            ftp_cep[cepid-1].remain_data = sizeof(MSG_INVALID_PATH) - 1;
            strcpy((char *)(ftp_cep[cepid-1].buff_ptr), MSG_INVALID_PATH);
            break;
        default:
            ftp_cep[cepid-1].remain_data = sizeof(MSG_MKD_RESPONSE) - 1;
            strcpy((char *)(ftp_cep[cepid-1].buff_ptr), MSG_MKD_RESPONSE);
            break;
    }
    return (0);
}


static int16_t ftps_rnfr(int16_t argc, int8_t **argv, ID cepid)
{
    uint8_t tmp_path[256];

    ftp_stat[(cepid-1)/2].rnfr = 0;
    if (ftp_cep[cepid-1].status < FTP_LOGIN)
    {
        ftp_cep[cepid-1].remain_data = sprintf((char *)(ftp_cep[cepid-1].buff_ptr), MSG_NOT_AVAILABLE);
        ftp_cep[cepid-1].status = FTP_CLOSING;
        return (-1);
    }
    if (argc != 2)
    {
        ftp_cep[cepid-1].remain_data = sizeof(MSG_PARAM_ERROR) - 1;
        strcpy((char *)(ftp_cep[cepid-1].buff_ptr), MSG_PARAM_ERROR);
        return -1;
    }


    if (0 != path_concatenate(cepid , tmp_path, sizeof(tmp_path), (uint8_t *)argv[1]))
    {
        ftp_cep[cepid-1].remain_data = sizeof(MSG_EXEC_ERROR) - 1;
        strcpy((char *)(ftp_cep[cepid-1].buff_ptr), MSG_EXEC_ERROR);
        return -1;
    }

    if (file_exist((uint8_t *)tmp_path) == 0)
    {
        strcpy((char *)(ftp_stat[(cepid-1)/2].fname), (const char *)tmp_path);
        ftp_cep[cepid-1].remain_data = sizeof(MSG_RNFR_RES) - 1;
        strcpy((char *)(ftp_cep[cepid-1].buff_ptr), MSG_RNFR_RES);
        ftp_stat[(cepid-1)/2].rnfr = 1;
    }
    else
    {
        ftp_cep[cepid-1].remain_data = sizeof(MSG_INVALID_PATH) - 1;
        strcpy((char *)(ftp_cep[cepid-1].buff_ptr), MSG_INVALID_PATH);
    }
    return (0);
}


static int16_t ftps_rnto(int16_t argc, int8_t **argv, ID cepid)
{
    uint8_t old_path[256];
    uint8_t new_path[256];
    int8_t cmdname[5];

    if (ftp_cep[cepid-1].status < FTP_LOGIN)
    {
        ftp_cep[cepid-1].remain_data = sprintf((char *)(ftp_cep[cepid-1].buff_ptr), MSG_NOT_AVAILABLE);
        ftp_cep[cepid-1].status = FTP_CLOSING;
        ftp_stat[(cepid-1)/2].rnfr = 0;
        return (-1);
    }
    if (ftp_stat[(cepid-1)/2].rnfr != 1)
    {
        ftp_cep[cepid-1].remain_data = sprintf((char *)(ftp_cep[cepid-1].buff_ptr), MSG_CMD_BAD_SEQ);
        return (-1);
    }
    if (argc != 2)
    {
        ftp_cep[cepid-1].remain_data = sizeof(MSG_PARAM_ERROR) - 1;
        strcpy((char *)(ftp_cep[cepid-1].buff_ptr), MSG_PARAM_ERROR);
        return -1;
    }

    strcpy((char *)cmdname, (const char *)argv[0]);

    ftp_stat[(cepid-1)/2].rnfr = 0;

