pwbf/RX64M_ETHERNET/r_t4_ftp_server_rx/src/r_ftp_server.c
            if (ercd == 0)
            {
                cmd_pcep->now_data = 0;

                /* Analyze a command and an argument */
                cmdline((int8_t *)(cmd_pcep->buff_ptr), &argc, argv);

                if (argc == 0)
                {
                    /* no command */
                    cmd_pcep->buff_ptr[0] = '\0';
                    non_support_cmd(cmd_cepid_oft, (int8_t *)cmd_pcep->buff_ptr);
                    tcp_snd_dat(cmd_cepid, (VP)cmd_pcep->buff_ptr, cmd_pcep->remain_data, TMO_NBLK);
                    break;
                }

                /* Analysis and the execute of the input command */
                p_cmd = (int8_t far **)ftps_cmd_tbl;
                for (i = 0; *p_cmd != NULL; i++, p_cmd++)
                {
                    /* search command */
                    if (stricmp_rx((uint8_t *)*p_cmd, (uint8_t *)argv[0], 5) == 0)
                    {
                        func_ret = (*ftps_cmd_exe[i])(argc, argv, cmd_cepid_oft);
                        break;
                    }
                }
                if (*p_cmd == NULL)
                {
                    /* No support command */
                    non_support_cmd(cmd_cepid_oft, argv[0]);
                    tcp_snd_dat(cmd_cepid, (VP)cmd_pcep->buff_ptr, cmd_pcep->remain_data, TMO_NBLK);
                    break;
                }
                if (pftpstat->exec_command != FTP_DATA_NONE && func_ret < 0)
                {
                    /* There is no send data. */
                    pftpstat->exec_command = FTP_DATA_NONE;
                    pftpstat->exec_command_subseq = 0;
                    tcp_cls_cep(data_cepid, TMO_NBLK);
                    data_pcep->status = FTP_CLOSING;
                    tcp_snd_dat(cmd_cepid, (VP)cmd_pcep->buff_ptr, cmd_pcep->remain_data, TMO_NBLK);
                    break;
                }
                switch (pftpstat->exec_command)
                {
                    case FTP_DATA_ABOR:
                        if (func_ret == 3)
                        {
                            /* command processing and the data port is established */
                        }
                        else if (func_ret == 2)
                        {
                            /*  command processing and the data port is closeed */
                            tcp_snd_dat(cmd_cepid, (VP)cmd_pcep->buff_ptr, cmd_pcep->remain_data, TMO_NBLK);
                        }
                        else if (func_ret == 1)
                        {
                            /* not in command processing and the data port is established */
                            pftpstat->exec_command = FTP_DATA_NONE;
                            pftpstat->exec_command_subseq = 0;
                            tcp_cls_cep(data_cepid, TMO_NBLK);
                            data_pcep->status = FTP_CLOSING;
                            tcp_snd_dat(cmd_cepid, (VP)cmd_pcep->buff_ptr, cmd_pcep->remain_data, TMO_NBLK);
                        }
                        else
                        {
                            /* not in command processing and the data port is closeed, or closing */
                            pftpstat->exec_command = FTP_DATA_NONE;
                            pftpstat->exec_command_subseq = 0;
                            tcp_snd_dat(cmd_cepid, (VP)cmd_pcep->buff_ptr, cmd_pcep->remain_data, TMO_NBLK);
                        }
                        break;
                    case FTP_DATA_PORT:
                        tcp_con_cep((data_cepid), &(data_pcep->myaddr), &(data_pcep->dstaddr), TMO_NBLK);
                        break;
                    case FTP_DATA_LIST:
                        tcp_snd_dat(cmd_cepid, (VP)cmd_pcep->buff_ptr, cmd_pcep->remain_data, TMO_NBLK);
                        break;
                    case FTP_DATA_STOR:
                        /* The reception in the data port */
                        data_pcep->remain_data = DATA_BUF_SIZE;
                        data_pcep->now_data = 0;
                        tcp_rcv_dat(data_cepid, data_pcep->buff_ptr, CMD_BUF_SIZE, TMO_NBLK);
                        tcp_snd_dat(cmd_cepid, (VP)cmd_pcep->buff_ptr, cmd_pcep->remain_data, TMO_NBLK);
                        break;
                    case FTP_DATA_RETR:
                        tcp_snd_dat(cmd_cepid, (VP)cmd_pcep->buff_ptr, cmd_pcep->remain_data, TMO_NBLK);
                        break;
                    default:
                        tcp_snd_dat(cmd_cepid, (VP)cmd_pcep->buff_ptr, cmd_pcep->remain_data, TMO_NBLK);
                        break;
                }
            }
            /* continue receiving */
            else if (ercd == 1)
            {
                tcp_rcv_dat(cmd_cepid, cmd_pcep->buff_ptr + cmd_pcep->remain_data, CMD_BUF_SIZE - cmd_pcep->remain_data, TMO_NBLK);
            }
            /* Error */
            else
            {
                tcp_cls_cep(cmd_cepid, TMO_NBLK);
                cmd_pcep->status = FTP_CLOSING;
                break;

            }
            break;
        case TFN_TCP_SHT_CEP:
            tcp_cls_cep(cmd_cepid, TMO_NBLK);
            cmd_pcep->status = FTP_CLOSING;
            break;
        case TFN_TCP_CLS_CEP:
            cmd_pcep->status = FTP_CLOSED;
            break;
        default:
            break;
    }
    return(0);
}


ER ftp_data_callback(ID cepid, FN fncd , VP p_parblk)
{

    ER   parblk = *(ER *)p_parblk;
    ER   ret;

    ID   cmd_cepid;
    ID   data_cepid;
    FTP_CEP   *cmd_pcep;
    FTP_CEP   *data_pcep;
    _FTP_STAT *pftpstat;
    ID   cmd_cepid_oft;
    ID   data_cepid_oft;

    if (0 != (FTP_START_TCP_CEP % 2))
    {
        while (1); /* System Error !! */
    }

    if (cepid > FTP_START_TCP_CEP)
    {
        cmd_cepid_oft = cepid - FTP_START_TCP_CEP - 1;
        data_cepid_oft = cmd_cepid_oft + 1;
    }
    else /* if (cepid > FTP_START_TCP_CEP) */
    {
        while (1);  /* System error !! */
    }

    cmd_cepid  = (cepid - 1);
    data_cepid = (cepid);
    cmd_pcep   = (&ftp_cep[cmd_cepid_oft-1]);
    data_pcep  = (&ftp_cep[data_cepid_oft-1]);
    pftpstat   = (&ftp_stat[(cmd_cepid_oft-1)/2]);


    if (parblk == E_RLWAI)
    {
        if (pftpstat->cep_reset_req == 0)
        {
            data_pcep->api_cancel = 0;
            switch (pftpstat->exec_command)
            {
                case FTP_DATA_ABOR:
                    ftps_abor_finish(cmd_cepid_oft);
                    tcp_snd_dat(cmd_cepid, (VP)cmd_pcep->buff_ptr, cmd_pcep->remain_data, TMO_NBLK);
                    tcp_cls_cep(data_cepid, TMO_NBLK);
                    data_pcep->status = FTP_CLOSING;
                    break;
            }
        }
        else
        {
            pftpstat->cep_reset_req |= 0x01;
        }
        return 0;
    }
    if (parblk < 0)
    {
        pftpstat->cep_reset_req = 0x10;
        return 0;
    }
    if (pftpstat->cep_reset_req > 0)
    {
        return 0;
    }
    switch (fncd)
    {
        case TFN_TCP_ACP_CEP:
            data_pcep->now_data = 0;
            data_pcep->remain_data = 0;
            data_pcep->status = FTP_CONNECTION;
        default:
            break;
        case TFN_TCP_CON_CEP:
            if (pftpstat->exec_command == FTP_DATA_PORT)
            {
                tcp_snd_dat(cmd_cepid, (VP)cmd_pcep->buff_ptr, cmd_pcep->remain_data, TMO_NBLK);
                pftpstat->exec_command = FTP_DATA_NONE;
            }
            data_pcep->now_data = 0;
            data_pcep->remain_data = 0;
            data_pcep->status = FTP_CONNECTION;
            break;
        case TFN_TCP_RCV_DAT:
            if (parblk == 0)
            {
                /* FIN */
                tcp_cls_cep(data_cepid, TMO_NBLK);
                data_pcep->status = FTP_CLOSING;
                break;
            }
            switch (pftpstat->exec_command)
            {
                case FTP_DATA_STOR:
                    if (pftpstat->exec_command_subseq == FTP_DATA_STOR_SUBSEQ04)
                    {
                        /* uploading */
                        data_pcep->now_data += parblk;
                        data_pcep->remain_data -= parblk;
                        if (data_pcep->remain_data > 0)
                        {
                            /* There are continuation data */
                            tcp_rcv_dat(data_cepid, data_pcep->buff_ptr + data_pcep->now_data, data_pcep->remain_data, TMO_NBLK);
                        }
                        else
                        {
                            if (ftps_stor_dataport(data_cepid_oft, data_pcep->now_data) < 0)
                            {
                                /* when FTP server failed to write file, FTP server ignores the reception data */
                                data_pcep->now_data = 0;
                                tcp_rcv_dat(data_cepid, data_pcep->buff_ptr, DATA_BUF_SIZE, TMO_NBLK);
                            }
                            else
                            {
                                /* File write success. continue receiving */
                                data_pcep->remain_data = DATA_BUF_SIZE;
                                data_pcep->now_data = 0;
                                tcp_rcv_dat(data_cepid, data_pcep->buff_ptr, DATA_BUF_SIZE, TMO_NBLK);
                            }
                        }
                    }
                    else
                    {
                        /* error occured in uploading */
                        data_pcep->now_data = 0;
                        tcp_rcv_dat(data_cepid, data_pcep->buff_ptr, DATA_BUF_SIZE, TMO_NBLK);
                    }
                    break;
            }
            break;
        case TFN_TCP_SND_DAT:
            switch (pftpstat->exec_command)
            {
                case FTP_DATA_LIST:
                    data_pcep->now_data += parblk;
                    data_pcep->remain_data -= parblk;
                    if (data_pcep->remain_data > 0)
                    {
                        tcp_snd_dat(data_cepid, (VP)(data_pcep->buff_ptr + data_pcep->now_data), data_pcep->remain_data, TMO_NBLK);
                    }
                    else
                    {
                        data_pcep->now_data = 0;
                        if (pftpstat->exec_command_subseq == FTP_DATA_LIST_SUBSEQ08)
                        {
                            /* transmit a list */
                            ret = ftps_list_nlst_dataport(data_cepid_oft);
                            if (ret > 0)
                            {
                                tcp_snd_dat(data_cepid, (VP)data_pcep->buff_ptr, data_pcep->remain_data, TMO_NBLK);
                            }
                            else
                            {
                                /* transmit lists. */
                                tcp_cls_cep(data_cepid, TMO_NBLK);
                                data_pcep->status = FTP_CLOSING;
                            }
                        }
                        else
                        {
                            /* transmit lists. */
                            tcp_cls_cep(data_cepid, TMO_NBLK);
                            data_pcep->status = FTP_CLOSING;
                        }
                    }

                    break;
                case FTP_DATA_RETR:
                    data_pcep->now_data += parblk;
                    data_pcep->remain_data -= parblk;
                    if (data_pcep->remain_data > 0)
                    {
                        tcp_snd_dat(data_cepid, (VP)(data_pcep->buff_ptr + data_pcep->now_data), data_pcep->remain_data, TMO_NBLK);
                    }
                    else
                    {
                        data_pcep->now_data = 0;
                        if (pftpstat->exec_command_subseq == FTP_DATA_RETR_SUBSEQ08)
                        {
                            ret = ftps_retr_dataport(data_cepid_oft);
                            if (ret > 0)
                            {
                                tcp_snd_dat(data_cepid, (VP)data_pcep->buff_ptr, data_pcep->remain_data, TMO_NBLK);
                            }
                            else
                            {
                                /* finish reading */
                                tcp_cls_cep(data_cepid, TMO_NBLK);
                                data_pcep->status = FTP_CLOSING;
                            }
                        }
                        else
                        {
                            /* error */
                            tcp_cls_cep(data_cepid, TMO_NBLK);
                            data_pcep->status = FTP_CLOSING;
                        }
                    }

                    break;
                default:
                    data_pcep->now_data = 0;
                    tcp_cls_cep(data_cepid, TMO_NBLK);
                    data_pcep->status = FTP_CLOSING;
                    break;
            }
            break;
        case TFN_TCP_SHT_CEP:
            tcp_cls_cep(data_cepid, TMO_NBLK);
            data_pcep->status = FTP_CLOSING;
            break;
        case TFN_TCP_CLS_CEP:
            data_pcep->status = FTP_CLOSED;
            switch (pftpstat->exec_command)
            {
                case FTP_DATA_LIST:
                    if (pftpstat->exec_command_subseq >= FTP_DATA_LIST_SUBSEQ12)
                    {
                        /* success */
                        pftpstat->exec_command_subseq = FTP_DATA_LIST_SUBSEQ16;
                    }
                    else
                    {
                        /* fail */
                        pftpstat->exec_command_subseq = FTP_DATA_SUBSEQ_ERR;
                    }
                    cmd_pcep->api_cancel = 1;

                    break;
                case FTP_DATA_STOR:
                    if (data_pcep->now_data > 0)
                    {
                        /* write last data block in tail of file */
                        ftps_stor_dataport(data_cepid_oft, data_pcep->now_data);
                    }
                    file_close(pftpstat->file_index);
                    cmd_pcep->api_cancel = 1;
                    break;
                case FTP_DATA_RETR:
                    if (pftpstat->exec_command_subseq == FTP_DATA_RETR_SUBSEQ12)
                    {
                        /* success */
                        pftpstat->exec_command_subseq = FTP_DATA_RETR_SUBSEQ16;
                    }
                    else
                    {
                        /* fail */
                        file_close(pftpstat->file_index);
                        pftpstat->exec_command_subseq = FTP_DATA_SUBSEQ_ERR;
                    }
                    cmd_pcep->api_cancel = 1;
                    break;
                case FTP_DATA_ABOR:
                    data_pcep->api_cancel = 0;
                    if (pftpstat->exec_command_subseq == FTP_DATA_ABOR_SUBSEQ04)
                    {
                        ftps_abor_finish(cmd_cepid_oft);
                        tcp_snd_dat(cmd_cepid, (VP)cmd_pcep->buff_ptr, cmd_pcep->remain_data, TMO_NBLK);
                    }
                    break;
            }
            break;
    }
    return 0;
}

/*****************************************************************************
* Function Name: R_T4_FTP_SERVER_GetVersion
* Description  : Returns the version of this module. The version number is
*                encoded such that the top two bytes are the major version
*                number and the bottom two bytes are the minor version number.
* Arguments    : none
* Return Value : version number
******************************************************************************/
#pragma inline(R_T4_FTP_SERVER_GetVersion)
uint32_t  R_T4_FTP_SERVER_GetVersion(void)
{
    uint32_t const version = (T4_FTP_SERVER_VERSION_MAJOR << 16) | T4_FTP_SERVER_VERSION_MINOR;

    return version;
}

/* Copyright 2005,2011 RENESAS ELECTRONICS CORPORATION */







